In [1]:
# Dependencies
import numpy as np
import datetime as dt 
import pandas as pd
# Python SQL toolkit and Object Relational Mapper
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func

In [2]:
engine = create_engine("sqlite:///hawaii.sqlite")

# reflect an existing database into a new model
Base = automap_base()
# reflect the tables
Base.prepare(engine, reflect=True)

# Save references to each table
Measurement = Base.classes.measurement
Station = Base.classes.station

In [3]:
Base.classes.keys()

['measurement', 'station']

In [4]:
# Create our session (link) from Python to the DB
session = Session(engine)

## D1: Determine the Summary Statistics for June

In [5]:
# 1. Import the sqlalchemy extract function.
from sqlalchemy import extract

# 2. Write a query that filters the Measurement table to retrieve the temperatures for the month of June. 
june_data = dt.date(2016, 6, 30) - dt.timedelta(days=29)

In [22]:
#  3. Convert the June temperatures to a list.
results = [] 
results = session.query(Measurement.date, Measurement.tobs).filter(Measurement.date >= june_data).all()

In [37]:
# 4. Create a DataFrame from the list of temperatures for the month of June. 
df = pd.DataFrame(results)
df.head(20)

          date  tobs
0   2016-06-01  76.0
1   2016-06-02  71.0
2   2016-06-03  71.0
3   2016-06-04  74.0
4   2016-06-05  76.0
5   2016-06-06  78.0
6   2016-06-07  77.0
7   2016-06-08  77.0
8   2016-06-09  73.0
9   2016-06-10  77.0
10  2016-06-11  78.0
11  2016-06-12  78.0
12  2016-06-13  80.0
13  2016-06-14  79.0
14  2016-06-15  78.0
15  2016-06-16  77.0
16  2016-06-17  76.0
17  2016-06-18  77.0
18  2016-06-19  77.0
19  2016-06-20  78.0

In [24]:
# 5. Calculate and print out the summary statistics for the June temperature DataFrame.
df.describe()

              tobs
count  2753.000000
mean     75.010171
std       4.463992
min      58.000000
25%      72.000000
50%      76.000000
75%      78.000000
max      87.000000

## D2: Determine the Summary Statistics for December

In [30]:
# 6. Write a query that filters the Measurement table to retrieve the temperatures for the month of December.
december_data = dt.date(2016, 12, 31) - dt.timedelta(days=30)

In [31]:
# 7. Convert the December temperatures to a list.
dec_results = []
dec_results =  session.query(Measurement.date, Measurement.tobs).filter(Measurement.date >= december_data).all()

In [36]:
# 8. Create a DataFrame from the list of temperatures for the month of December. 
dec_df = pd.DataFrame(dec_results)
dec_df.head(20)

          date  tobs
0   2016-12-01  75.0
1   2016-12-02  72.0
2   2016-12-03  69.0
3   2016-12-04  71.0
4   2016-12-05  68.0
5   2016-12-06  67.0
6   2016-12-07  69.0
7   2016-12-08  73.0
8   2016-12-09  70.0
9   2016-12-10  70.0
10  2016-12-11  70.0
11  2016-12-12  66.0
12  2016-12-13  67.0
13  2016-12-14  70.0
14  2016-12-15  66.0
15  2016-12-16  62.0
16  2016-12-17  71.0
17  2016-12-18  73.0
18  2016-12-19  69.0
19  2016-12-20  77.0

In [33]:
# 9. Calculate and print out the summary statistics for the Decemeber temperature DataFrame.
dec_df.describe()

              tobs
count  1597.000000
mean     73.766437
std       4.867794
min      58.000000
25%      70.000000
50%      74.000000
75%      77.000000
max      87.000000